{
  "food": [
    {
      "name": "Keleya-Zaara",
      "imageUrl": "https://i.ibb.co/LtDMHT6/Keleya-Zaara.jpg",
      "description": "Keleya-Zaara is a traditional Nigerian soup made with assorted meat, fish, and vegetables. It is known for its rich flavors and nutritious ingredients.",
      "type": "Soup",
      "process": [
        "To prepare Keleya-Zaara, start by cooking assorted meats (such as beef, goat, or cow foot) and smoked fish in a pot with water and seasonings.",
        "In another pot, cook a mixture of chopped vegetables, including spinach, pumpkin leaves, and okra.",
        "Once the meats are tender and the vegetables are cooked, combine them in a single pot and let them simmer together.",
        "Add palm oil and ground crayfish for added flavor.",
        "Allow the soup to simmer for some time to allow the flavors to meld together.",
        "Serve the Keleya-Zaara hot with a side of pounded yam or fufu.",
        "Enjoy the rich and nutritious flavors of this traditional Nigerian soup!",
        "Serve the Yummy!"
      ],
      "ingredients": [
        "goat meat or beef",
        "dried fish",
        "smoked fish",
        "stockfish",
        "crayfish",
        "ugu (pumpkin leaves)",
        "water leaves",
        "palm oil",
        "onions",
        "fresh pepper",
        "ogiri (locust bean)",
        "periwinkle",
        "salt",
        "seasoning cubes",
        "ground crayfish"
      ],
      "id": 3
    },
    {
      "name": "Roast Red Wine Lamb",
      "imageUrl": "https://i.ibb.co/PNHLzPG/recipe-image-legacy-id-5371-11-e4e1931.webp",
      "description": "Roast Red Wine Lamb is a delicious and flavorful dish made by marinating and roasting lamb in a red wine-based marinade. The wine adds a rich depth of flavor to the meat, making it tender and succulent",
      "type": "Roast",
      "process": [
        "   - In a large mixing bowl, combine the red wine, minced garlic, chopped rosemary, chopped thyme, olive oil, salt, and pepper. Mix well to combine.",
        "   - Place the lamb in a shallow dish or a resealable plastic bag, and pour the marinade over it, ensuring the meat is fully coated. Cover the dish or seal the bag, and refrigerate for at least 4 hours, preferably overnight, to allow the flavors to infuse into the lamb.",
        "   - Preheat your oven to 325°F (163°C). ",
        "   - Remove the lamb from the marinade, allowing any excess marinade to drip off.",
        "   - Place the lamb on a roasting rack set inside a roasting pan. This helps elevate the meat and allows the heat to circulate evenly.",
        "   - Season the lamb with additional salt and pepper, if desired.",
        "   - Pour the remaining marinade into the bottom of the roasting pan to create a flavorful base for basting and gravy.",
        "   - Insert a meat thermometer into the thickest part of the lamb, ensuring it doesn't touch the bone.",
        "   - Place the roasting pan with the lamb in the preheated oven.",
        "   - Cook the lamb for about 20 minutes per pound (45 minutes per kilogram) for medium-rare doneness. Adjust the cooking time according to your preferred level of doneness.",
        "   - Baste the lamb with the marinade and pan juices every 30 minutes to keep it moist and flavorful.",
        "   - Check the internal temperature of the lamb periodically. Remove the lamb from the oven when the thermometer registers 135°F (57°C) for medium-rare, 145°F (63°C) for medium, or to your desired level of doneness.",
        "   - Once the lamb reaches your desired level of doneness, remove it from the oven.",
        "   - Tent the lamb with aluminum foil and let it rest for 10-15 minutes. This allows the juices to redistribute and the meat to become even more tender.",
        "   - Slice the lamb into desired portions and serve it with the pan juices or a red wine reduction.",
        "   - Optionally, garnish the lamb with fresh herbs like rosemary or thyme for added presentation and flavor.",
        "Enjoy your delicious Roast Red Wine Lamb with your favorite side dishes such as roasted vegetables, mashed potatoes, or a fresh salad!"
      ],
      "ingredients": [
        "1 leg of lamb",
        "red wine",
        "rosemary sprigs",
        "garlic cloves",
        "olive oil",
        "salt",
        "black pepper",
        "onions",
        "carrots",
        "celery",
        "beef broth",
        "all-purpose flour",
        "butter"
      ],
      "id": "2"
    },
    {
      "name": "Chicken Biryani",
      "imageUrl": "https://i.ibb.co/4ph2zpQ/Pngtree-chicken-dum-biryani-hydrabadi-baked-9037440.png",
      "description": "A flavorful Indian dish made with spiced rice, tender chicken, and aromatic herbs and spices such as cardamom, cumin, and saffron.",
      "type": "Spicy",
      "process": [
        "Wash the rice several times in cold water and soak it for 30 minutes.",
        "Heat 1 tablespoon of ghee in a large pot and add the cumin seeds, coriander seeds, cinnamon stick, cloves, cardamom pods, and bay leaf. Fry for a minute or two, until fragrant.",
        "Add the sliced onions to the pot and cook until they are soft and translucent.",
        "Add the chicken pieces to the pot and cook for 5 - 7 minutes, until the chicken is browned.",
        "Add the ginger-garlic paste, salt, and biryani masala to the pot and stir to combine.",
        "Add the yogurt to the pot and mix well.",
        "Cover the pot and let the chicken cook for 15 - 20 minutes, stirring occasionally.",
        "While the chicken is cooking, bring a large pot of salted water to a boil.",
        "Drain the soaked rice and add it to the pot.",
        "Cook the rice for 5 - 7 minutes, until it is partially cooked.",
        "Drain the rice and set it aside.",
        "Dissolve the saffron strands in warm milk and set aside.",
        "Preheat the oven to 350°F.",
        "Layer the chicken and rice in a large oven-safe dish. Start with a layer of rice, then a layer of chicken, and repeat until all of the rice and chicken are used up.",
        "Pour the saffron milk over the top of the rice and chicken.",
        "Sprinkle the chopped cilantro leaves, mint leaves, and fried onions over the top of the rice.",
        "Cover the dish tightly with foil and bake in the preheated oven for 20 - 25 minutes.",
        "Remove the foil and bake for an additional 5 - 10 minutes, until the top of the rice is golden brown.",
        "Remove from the oven and let the biryani rest for 5 - 10 minutes before serving."
      ],
      "ingredients": [
        "Chicken",
        "Basmati rice ",
        "Onion ",
        "Tomato",
        "Yogurt",
        "Ginger-garlic paste",
        "Green chili",
        "Mint leaves",
        "Cilantro",
        "Biryani masala,Turmeric powder,Red chili powder,Cumin powder,Coriander powder,Garam masala,Bay leaf,Cinnamon stick,Cardamom pods,Cloves,Saffron strands,Milk,Rose water,Lemon juice,Ghee,Oil,Salt,Water"
      ],
      "videoLink":"https://video.link/w/vl647fe8bf51cba",
      "id": "1"
    },
    {
      "name": "Roasted Goat",
      "imageUrl": "https://i.ibb.co/KNzpHHX/Roasted-Goat.jpg",
      "description": "A savory African dish made by roasting a whole goat until the meat is tender and flavorful. It is often served with rice or other starchy side dishes.",
      "type": "savory",
      "process": [
        "To cook roasted goat, start by preheating your oven to 350 degrees Fahrenheit",
        "Then, prepare your goat by seasoning it with salt, pepper, and any other desired herbs and spices.",
        "Place the goat in a roasting pan and add chopped vegetables such as onions, carrots, and celery around it.",
        "Pour some chicken broth or water into the pan and cover it with foil.",
        "Roast the goat for about 3 to 4 hours, depending on its size, until it reaches an internal temperature of 145 degrees Fahrenheit.",
        "After that, remove the foil and continue to roast for another 30 minutes to an hour, or until the skin is crispy and browned.",
        "Let the goat rest for 10 to 15 minutes before carving and serving. Enjoy!"
      ],
      "ingredients": [
        "Goat leg",
        "Garlic cloves",
        "Fresh rosemary sprigs",
        "Lemon",
        "Olive oil",
        "Salt",
        "Black pepper",
        "Onion",
        "Carrots",
        "Potatoes",
        "Chicken broth",
        "Red wine",
        "Bay leaves"
      ],
      "id": "4"
    },
    {
      "name": "Fish-fofos",
      "imageUrl": "https://i.ibb.co/LtDMHT6/Keleya-Zaara.jpg",
      "description": "A spicy African soup made with fish, tomatoes, onions, and a variety of seasonings such as chili peppers, ginger, and garlic. It is often served with rice or bread.",
      "type": "spicy",
      "process": [
        "Fish-fofos is a traditional Brazilian fish stew that is typically made with salt cod, onions, tomatoes, and coconut milk.",
        "To cook fish-fofos, start by soaking the salt cod in water for at least 24 hours to remove the excess salt.",
        "Once the cod is soakedrain and rinse it well and then cut it into bite-sized pieces.",
        "In a large pot, sauté chopped onions, garlic, and diced tomatoes in olive oil until soften.",
        "Add the salt cod to the pot and sauté for a few minutes until lightly browned.",
        "Pour in enough water to cover the fish, bring to a boil, and then reduce the heat and let simmer for about 15 minutes.",
        "Stir in coconut milk and continue to simmer for another 5-10 minutes.",
        "Serve hot with white rice and garnish with chopped cilantro or parsley, if desired."
      ],
      "ingredients": [
        "Potatoes",
        "Fish fillets",
        "Chopped onions",
        "Minced garlic",
        "Chopped parsley",
        "Herbs and spices",
        "Oil"
      ],
      "id": "13"
    },
    {
      "name": "Eggs-Benedict",
      "imageUrl": "https://i.ibb.co/BnnnrZM/Eggs-Benedict.jpg",
      "description": "A classic breakfast dish of poached eggs and Canadian bacon on an English muffin, topped with hollandaise sauce.",
      "type": "breakfast",
      "process": [
        "To cook Eggs Benedict, first prepare the Hollandaise sauce by whisking egg yolks, lemon juice, and butter in a heatproof bowl over a pot of simmering water until thick and creamy.",
        "Keep it warm over the pot. Toast English muffins and fry Canadian bacon in a skillet until crispy.",
        "Poach eggs by bringing a pot of salted water to a simmer, adding a splash of white vinegar, and gently dropping in the eggs one at a time.",
        "Cook for 3-4 minutes until the whites are set but the yolks are still runny.",
        "Assemble the Eggs Benedict by placing a slice of bacon on each muffin half, topping with a poached egg, and drizzling with Hollandaise sauce.",
        " Garnish with chopped chives or parsley and serve immediately.",
        " Enjoy your delicious Eggs Benedict!"
      ],
      "ingredients": [
        "English muffins",
        "Canadian bacon",
        "fresh eggs",
        "unsalted butter",
        "white vinegar",
        "salt",
        "black pepper",
        "hollandaise sauce"
      ],
      "id": "5"
    },
    {
      "name": "Escovitch-Fish",
      "imageUrl": "https://i.ibb.co/PGzdhVr/Escovitch-Fish.jpg",
      "description": "A Caribbean dish made with fried fish that is marinated in a spicy vinegar-based sauce and served with vegetables such as onions, carrots, and peppers.",
      "type": "spicy",
      "process": [
        "To cook Escovitch fish, start by cleaning and scaling the fish, then score it on both sides and season with salt and pepper.",
        "In a large skillet or frying pan, heat vegetable oil over medium-high heat and fry the fish until golden brown on both sides.",
        "Remove the fish from the pan and set it aside. In the same pan, add sliced onions, bell peppers, carrots, and scotch bonnet peppers and sauté for a few minuteAdd white vinegar, water, and sugar to the pan and bring the mixture to a boil.",
        "Let it simmer for a few minutes before pouring it over the fried fish in a shallow dish.",
        "Let the fish marinate in the mixture for at least 30 minutes before serving.",
        " Garnish with additional sliced vegetables and enjoy!"
      ],
      "ingredients": [
        "Fish fillets",
        "All-purpose flour",
        "Salt",
        "Black pepper",
        "Paprika",
        "Vegetable oil",
        "Onion",
        "Carrot",
        "Bell pepper",
        "Scotch bonnet pepper",
        "Garlic cloves",
        "minced",
        "White vinegar",
        "Sugar",
        "Water",
        "Lime juice",
        "Fresh thyme",
        "Bay leaves",
        "Black pepper"
      ],
      "id": "6"
    },
    {
      "id": "7",
      "name": "Dal fry",
      "description": "A vegetarian Indian dish made with lentils that have been cooked and spiced with cumin, turmeric, and other seasonings. It is often served with rice or flatbread.",
      "imageUrl": "https://i.ibb.co/C7gXcYS/Dal-fry.jpg",
      "type": "veg",
      "hostid": "123",
      "process": [
        "To cook Dal fry, start by washing 1 cup of lentils (such as toor dal, masoor dal, or chana dal) and then soaking them in water for 30 minutes.",
        " After the dal has soakedrain the water and add the lentils to a pressure cooker with 3 cups of water, 1/2 teaspoon of turmeric powder, and 1/2 teaspoon of salt.",
        " Cook the dal in the pressure cooker for 3-4 whistles or until the dal is fully cooked and soft.",
        " In a separate pan, heat 2 tablespoons of oil or ghee and add 1 teaspoon of cumin seeds, 1 teaspoon of minced garlic, and 1 teaspoon of grated ginger.",
        " Saute for a minute and then add 1 chopped onion and fry until it turns golden browAdd 2 chopped tomatoes and cook until they become soft and mushy.",
        " Once the dal is fully cooked, add it to the pan with the onion and tomato mixture and mix welAdd 1/2 teaspoon of garam masala powder and 1/2 teaspoon of red chili powder (or to taste) and mix again.",
        " Let the dal simmer for a few minutes until it reaches the desired consistency.",
        " Serve hot with rice or roti."
      ]
    },
    {
      "id": "8",
      "name": "Chicken-Enchilada",
      "description": "A Mexican dish made with shredded chicken, cheese, and chili sauce, rolled up in a tortilla and baked. It is often served with rice and beans.",
      "imageUrl": "https://i.ibb.co/zxZnXxP/Chicken-Enchilada-Casserole.jpg",
      "type": "mexican",
      "hostid": "123",
      "process": [
        "To cook chicken enchiladas, start by preheating the oven to 350 degrees Fahrenheit.",
        " Then, cook chicken breasts until they are no longer pink inside and shred them with a fork.",
        " Next, mix the chicken with enchilada sauce, diced green chilies, and shredded cheese.",
        " Warm the tortillas in the microwave or on a skillet and spoon the chicken mixture onto each tortilla, rolling them up tightly.",
        "Place the rolled tortillas in a baking dish and pour more enchilada sauce on top.",
        "Sprinkle with more shredded cheese and bake in the preheated oven for 20-25 minutes, or until the cheese is melted and bubbly.",
        " Serve with toppings such as diced tomatoes, avocado, and sour cream."
      ]
    },
    {
      "id": "9",
      "name": "Brown-Strew-Chicken",
      "description": "A hearty stew made with chicken that has been browned in a pot and then cooked slowly with vegetables such as carrots, potatoes, and onions, as well as herbs and spices such as thyme and bay leaves.",
      "imageUrl": "https://i.ibb.co/4tFDFf1/Brow-Stew-Chicken.jpg",
      "type": "stew",
      "hostid": "123",
      "process": [
        "To cook brown stew chicken, start by seasoning the chicken pieces with salt, black pepper, and your choice of seasonings.",
        " Heat some oil in a large Dutch oven or deep frying pan over medium-high heat, and brown the chicken on all sides until golden brown.",
        " Remove the chicken from the pan and set it aside.",
        " In the same pan, sauté onions, garlic, and ginger until fragrant, then add diced tomatoes, tomato paste, and chicken broth.",
        " Bring the mixture to a simmer, then return the chicken to the pan, cover it with a lid, and let it cook for 30-40 minutes or until the chicken is fully cooked and the sauce has thickened.",
        " Adjust the seasoning to taste, and serve hot over rice or with your favorite side dishes."
      ]
    },
    {
      "id": "10",
      "name": "Bharat",
      "description": " A Middle Eastern spice blend that typically includes cinnamon, coriander, cumin, cardamom, and other aromatic spices. It is often used to flavor meats, stews, and rice dishes.",
      "imageUrl": "https://i.ibb.co/9b93vhp/Bharat.jpg",
      "type": "spice blend",
      "hostid": "123",
      "process": [
        "Bharat is a versatile spice blend commonly used in Indian cuisine.",
        "To make it, start by dry roasting whole spices such as cumin, coriander, black peppercorns, cardamom pods, cloves, cinnamon sticks, and dried red chilies until fragrant.",
        "Allow the roasted spices to cool before grinding them into a fine powder using a spice grinder or mortar and pestlAdd ground nutmeg and mace to the spice mix and stir to combine.",
        "Store bharat in an airtight container and use it to add depth and flavor to dishes such as stews, soups, and marinades."
      ]
    },
    {
      "id": "11",
      "name": "Beef-Brisket-Pot-Roast",
      "description": "An American comfort food made with beef brisket that has been slow-cooked in a pot with vegetables such as carrots, onions, and potatoes, as well as seasonings such as thyme and bay leaves.",
      "imageUrl": "https://i.ibb.co/7CYXcVX/Beef-Brisket-Pot-Roast.jpg",
      "type": "American",
      "hostid": "123",
      "process": [
        "To cook a delicious beef brisket pot roast, start by preheating the oven to 325°F.",
        " Then, heat a large oven-safe pot or Dutch oven on the stove over medium-high heat.",
        " Season a 3-4 pound beef brisket with salt and pepper, and then sear it in the pot for 3-4 minutes on each side until browned.",
        " Remove the brisket from the pot and set it asid.",
        "Add chopped onions, carrots, and celery to the pot, and sauté for 5 minutes until they begin to soften.",
        " Next, add minced garlic and sauté for an additional minute. Pour in beef broth, red wine, and tomato paste, and bring the mixture to a simmer.",
        " Place the beef brisket back in the pot, cover it with a lid, and transfer it to the preheated oven.",
        " Cook for 3-4 hours, or until the brisket is fork-tender.",
        " Serve the beef brisket pot roast with the vegetables and sauce."
      ]
    },
    {
      "id": "12",
      "name": "Beef-and-oster-pie",
      "description": "A savory English dish made with beef and oysters that have been cooked with onions and seasonings, then baked in a pastry crust. It is often served with mashed potatoes and gravy.",
      "imageUrl": "https://i.ibb.co/7k9ckfb/Beef-and-oster-pie.jpg",
      "type": "pastry",
      "hostid": "123",
      "process": [
        "Beef and oyster pie is a classic dish that is both hearty and delicious.",
        " To make the filling, start by heating oil in a large skillet over medium-high heat.",
        " Add diced onions and cook for 5 minutes until they begin to soften.",
        " Add diced beef, and cook for 5-7 minutes until browned on all sides.",
        "Next, add beef broth, Worcestershire sauce, and seasonings such as salt, pepper, thyme, and bay leaves.",
        " Reduce the heat and let the mixture simmer for 1-2 hours, or until the beef is tender.",
        " While the beef cooks, shuck 12-16 oysters and set them aside.",
        " Once the beef is cooked, remove the bay leaves and transfer the mixture to a pie dish.",
        " Place the oysters on top of the beef mixture, and then cover everything with a layer of puff pastry.",
        " Brush the pastry with an egg wash, and then bake in the oven at 400°F for 20-25 minutes, or until the pastry is golden brown and the oysters are cooked.",
        " Let the pie cool for a few minutes before slicing and serving."
      ]
    },
    {
      "name": "Lamb Biryani",
      "imageUrl": "https://i.ibb.co/S3GDmQs/Mutton-Biryani.jpg",
      "description": "Lamb Biryani is a combination of tender lamb meat, aromatic spices, and fragrant basmati rice. The meat is marinated in a mixture of yogurt and spices, which helps to tenderize it and infuse it with flavors.",
      "type": "Rice Dish",
      "process": [
        "- In a bowl, combine 1 kg (2.2 lbs) of lamb pieces (such as bone-in chunks or boneless cubes) with 1 cup of plain yogurt, 2 tablespoons of ginger-garlic paste, 1 tablespoon of red chili powder, 1 teaspoon of turmeric powder, 1 teaspoon of garam masala, 2 tablespoons of biryani masala, 2 tablespoons of lemon juice, and salt to taste.",
        "   - Mix everything well, ensuring that all the meat pieces are coated with the marinade.",
        "   - Cover the bowl and let the lamb marinate in the refrigerator for at least 2 hours, or preferably overnight, to allow the flavors to develop.",
        "   - Wash 3 cups of basmati rice under cold water until the water runs clear.",
        "   - Soak the rice in water for 30 minutes.",
        "   - In a large pot, bring 8 cups of water to a boil.",
        "   - Add 1 tablespoon of salt and the soaked rice to the boiling water.",
        "   - Cook the rice until it is 70-80% cooked (still slightly firm in the center).",
        "   - Drain the rice and set it aside.",
        "   - In a large, heavy-bottomed pot or a biryani handi, heat 4-5 tablespoons of ghee or oil.",
        "   - Add whole spices like bay leaves, cinnamon sticks, cardamom pods, and cloves to the hot ghee or oil and let them sizzle for a few seconds to release their flavors.",
        "   - Add thinly sliced onions and sauté until they turn golden brown and caramelized.",
        "   - Add the marinated lamb along with its marinade to the pot and cook on medium heat until the lamb is browned and partially cooked.",
        "   - Layer the partially cooked rice over the lamb, spreading it evenly.",
        "   - Drizzle some saffron milk (soak a pinch of saffron in warm milk) or yellow food coloring diluted in milk over the rice to create a vibrant color and aroma.",
        "   - Sprinkle some chopped mint leaves and fried onions on top of the rice.",
        "   - Cover the pot with a tight-fitting lid and cook on low heat for about 30-40 minutes, or until the lamb is fully cooked and the flavors have melded together.",
        "   - Once cooked, gently mix the rice and lamb together before serving.",
        "Serve the delicious Lamb Biryani hot, garnished with additional fried onions, mint leaves, and sliced boiled eggs, if desired. Accompany it with raita (yogurt dip) or a side salad for a complete meal. Enjoy the rich flavors and aromatic experience of this traditional Indian dish!"
      ],
      "ingredients": [
        "1 kg (2.2 lbs) lamb",
        "1 cup plain yogurt",
        "2 tablespoons ginger-garlic paste",
        "1 tablespoon red chili powder",
        "1 teaspoon turmeric powder",
        "1 teaspoon garam masala",
        "2 tablespoons biryani masala",
        "2 tablespoons lemon juice",
        "3 cups basmati rice",
        "8 cups water",
        "1 tablespoon salt",
        "4-5 tablespoons ghee or oil",
        "Whole spices (2 bay leaves, 2 cinnamon sticks, 4-5 cardamom pods, 6-8 cloves)",
        "2 large onions, thinly sliced and caramelized",
        "Saffron strands (optional) soaked in warm milk or yellow food coloring diluted in milk",
        "Fresh mint leaves, chopped",
        "Fried onions (for garnish)"
      ],
      "id": "14"
    },
    {
      "name": "Prawns Biriyani",
      "imageUrl": "https://i.ibb.co/DpJcZjr/prawn-biryani.jpg",
      "description": "Prawn Biryani features juicy prawns cooked with aromatic spices, layered with basmati rice, and slow-cooked to create a fragrant and flavorsome one-pot meal. The prawns are marinated in a blend of spices and yogurt to enhance their taste and tenderness",
      "type": "Rice Dish",
      "process": [
        "Clean and devein 500 grams (1.1 lbs) of prawns, leaving the tails intact.",
        "In a bowl, combine the prawns with 1 tablespoon ginger-garlic paste, 1 teaspoon red chili powder, 1/2 teaspoon turmeric powder, 1 teaspoon biryani masala, 2 tablespoons yogurt, 1 tablespoon lemon juice, and salt to taste.",
        "Mix well, ensuring that the prawns are evenly coated with the marinade.",
        "Cover the bowl and let the prawns marinate for about 30 minutes.",
        "Wash 2 cups of basmati rice under cold water until the water runs clear.",
        "Soak the rice in water for 30 minutes.",
        "In a large pot, bring 6 cups of water to a boil.",
        "Add 1 tablespoon of salt and the soaked rice to the boiling water.",
        "Cook the rice until it is 70-80% cooked (slightly firm in the center).",
        "Drain the rice and set it aside.",
        "In a large, heavy-bottomed pot or a biryani handi, heat 3-4 tablespoons of ghee or oil.",
        "Add whole spices such as bay leaves, cinnamon sticks, cardamom pods, and cloves to the hot ghee or oil and let them sizzle for a few seconds to release their flavors.",
        "Add thinly sliced onions and sauté until they turn golden brown and caramelized.",
        "Add the marinated prawns along with the marinade to the pot and cook for a few minutes until the prawns start to turn pink.",
        "Layer the partially cooked rice over the prawns, spreading it evenly.",
        "Drizzle some saffron milk (soak a pinch of saffron in warm milk) or yellow food coloring diluted in milk over the rice for a vibrant color and aroma.",
        "Sprinkle some chopped mint leaves and fried onions on top of the rice.",
        "Cover the pot with a tight-fitting lid and cook on low heat for about 20-25 minutes, allowing the flavors to meld and the prawns to cook fully."
      ],
      "ingredients": [
        "500 grams (1.1 lbs) prawns, cleaned and deveined",
        "1 tablespoon ginger-garlic paste",
        "1 teaspoon red chili powder",
        "1/2 teaspoon turmeric powder",
        "1 teaspoon biryani masala",
        "2 tablespoons yogurt",
        "1 tablespoon lemon juice",
        "Salt to taste",
        "2 cups basmati rice",
        "6 cups water",
        "1 tablespoon salt",
        "3-4 tablespoons ghee or oil",
        "Whole spices (2 bay leaves, 2 cinnamon sticks, 4-5 cardamom pods, 6-8 cloves)",
        "2 large onions, thinly sliced and caramelized",
        "Saffron strands (optional) soaked in warm milk or yellow food coloring diluted in milk",
        "Fresh mint leaves, chopped",
        "Fried onions (for garnish)"
      ],
      "id": "15"
    }
  ]
}